Re 100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       214560;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       214680;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2160;
        startFace       214800;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          480;
        startFace       216960;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          86400;
        startFace       217440;
    }
)

// ************************************************************************* //
