Re 100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    // pre-block
    (0 0 0) // 0
    (4 0 0) // 1
    (4 -2 0) // 2 
    (0 -2 0) // 3
    
    (0 0 -4) // 4
    (4 0 -4) // 5
    (4 -2 -4) // 6
    (0 -2 -4) // 7

    // obstacle blocks
    (8 0 0) // 8
    (8 -2 0) // 9

    (5.8585 0 -1.8585) // 10
    (6.1414 0 -1.8585) // 11
    (6.1414 -2 -1.8585) // 12
    (5.8585 -2 -1.8585) // 13

    (5.8585 0 -2.1414) // 14
    (5.8585 -2 -2.1414) // 15
    (6.1414 0 -2.1414) // 16
    (6.1414 -2 -2.1414) //17

    (8 0 -4) // 18
    (8 -2 -4) // 19

    // post-block
    (28 0 0) // 20
    (28 -2 0) // 21
    (28 0 -4) // 22
    (28 -2 -4) // 23
);

blocks
(
    // pre-block
    hex ( 0  1  2  3  4  5  6  7) (120 2 60) simpleGrading (1 1 1)

    // obstacle blocks
    hex ( 1  8  9  2 10 11 12 13) (60 2 60) simpleGrading (1 1 1) // bottom
    hex ( 1 10 13  2  5 14 15  6) (60 2 60) simpleGrading (1 1 1) // left
    hex (14 16 17 15  5 18 19  6) (60 2 60) simpleGrading (1 1 1) // top
    hex (11  8  9 12 16 18 19 17) (60 2 60) simpleGrading (1 1 1) // right

    // post-block
    hex ( 8 20 21  9 18 22 23 19) (360 2 60) simpleGrading (1 1 1)
);

edges
(
  arc 10 11 (6 0 -1.8)
  arc 12 13 (6  -2 -1.8)
  arc 14 10 (5.8 0 -2)
  arc 15 13 (5.8 -2 -2)
  arc 14 16 (6 0 -2.2) 
  arc 15 17 (6 -2 -2.2)
  arc 16 11 (6.2 0 -2)
  arc 17 12 (6.2 -2 -2) 

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0  4  7  3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            ( 4  5  6  7)
            ( 5 18 19  6)
            (18 22 23 19)

            ( 0  1  2  3)
            ( 1  8  9  2)
            ( 8 20 21  9)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (10 11 12 13)
            (11 16 17 12)
            (14 16 17 15)
            (10 14 15 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  1  5  4)
            ( 1 10 14  5)
            (14 16 18  5)
            (11  8 18 16)
            ( 1  8 11 10)
            ( 8 20 22 18)

            ( 3  7  6  2)
            ( 2  6 15 13)
            (15  6 19 17)
            (12 17 19  9)
            ( 2 13 12  9)
            ( 9 19 23 21)
        );
    }
);

mergePatchPairs
(
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
